of-run/canal/canal3D/03-canal3DRAS-probes/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (1.5 0.08125 0.115)
    (1.5 0.09375 0.115) 	
    (1.5 0.10625 0.115)
    (1.5 0.11875 0.115)
    (1.5 0.13125 0.115)
    (1.5 0.14375 0.115)
    (1.5 0.15625 0.115)
    (1.5 0.16875 0.115)
    (1.5 0.18125 0.115)
    (1.5 0.19375 0.115)
    (1.5 0.20625 0.115)
    (1.5 0.21875 0.115)
    (1.5 0.23125 0.115)
    (1.5 0.24375 0.115)
    (1.5 0.25625 0.115)
    (1.5 0.26875 0.115)
    (1.5 0.28125 0.115)
    (1.5 0.29375 0.115)
    (1.5 0.30625 0.115)



);

// ************************************************************************* //
